app/views/users/user_action.html.erb

                                          <p id="commentimage">
                                            <%if prayer.user.binary_data.blank?%>
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1