app/controllers/api_controller.rb

INSERT INTO `comments` (`user_id`, `comment`, `created_at`, `updated_at`, `prayer_id`) VALUES (3, 'htcandltc', '2011-03-28 06:44:22', '2011-03-28 06:44:22', 1)
---
  def add_comment
	@commenterror = ""
	if   params[:comment].blank?  or params[:comment].length > 100
		@commenterror = "Please Enter A Comment More Than 0 And Less Than 100 character"
	else
	     comment = Comment.new(:prayer_id=>params[:prayer_id],:user_id=>current_user.id,:comment=>params[:comment])
	     comment.save

SELECT `prayers`.* FROM `prayers` WHERE (`prayers`.`id` = 6) LIMIT 1
UPDATE `prayers` SET `viewed_no` = 2, `updated_at` = '2011-03-28 06:39:29' WHERE (`prayers`.`id` = 6)
---
  def add_prayer_viewed
      prayer = Prayer.find(params[:id])
      prayer.viewed_no = prayer.viewed_no.to_i + 1
      prayer.save

SELECT `prayers`.* FROM `prayers` WHERE (`prayers`.`id` = 5) LIMIT 1
UPDATE `prayers` SET `viewed_no` = 1, `updated_at` = '2011-03-28 06:35:45' WHERE (`prayers`.`id` = 6)
---
  def add_prayer_prayed
      prayer = Prayer.find(params[:id])
      prayer.prayed_no = prayer.prayed_no.to_i + 1
      prayer.save

INSERT INTO `prayers` (`user_id`, `prayer`, `created_at`, `updated_at`, `location`, `title`, `description`, `lat`, `lang`) VALUES (3, NULL, '2011-03-24 13:44:48', '2011-03-24 13:44:48', NULL, 'ok', 'okkk', NULL, NULL)
---
  def create_prayer
    @prayer = Prayer.new(params[:prayer])
    @prayer.user_id = current_user.id
      if params[:prayer].blank? or params[:prayer][:title].blank? or params[:prayer][:description].blank?
          flash[:notice] = "Please Enter A Prayer All Fields"
          respond_to do |format|
               format.xml  { render :xml => "<?xml version='1.0' encoding='UTF-8'?><message>please enter proper field</message>", :status => :unprocessable_entity }
               format.html {redirect_to :back}
          end
      else
          respond_to do |format|
            @prayer_created = true
            if @prayer.save

SELECT `prayers`.* FROM `prayers` WHERE (`prayers`.user_id = 3) ORDER BY id desc
---
  def current_user_prayers
    @uprayer = current_user.prayers.all(:order => "id desc")

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 3) LIMIT 1
---
  def get_all_users
    @users = User.find(:all)

SELECT `prayers`.* FROM `prayers` WHERE (user_id in (1,3)) ORDER BY id desc
---
  def prayers
     total_friend_user = current_user.friends
     total_friend_ids = []
     total_friend_user.each {|frid|  total_friend_ids << frid.id  }
     total_friend_ids << current_user.id
     @uprayer=[]
     @uprayer = Prayer.find(:all,:conditions=>"user_id in (#{total_friend_ids.join(',')})",:order =>"id desc")

SELECT `prayers`.* FROM `prayers` WHERE (`prayers`.`id` = 6) LIMIT 1
---
  def get_prayer_comments
	  @prayer = Prayer.find(params[:id])