app/controllers/prayers_controller.rb

INSERT INTO `prayers` (`user_id`, `prayer`, `created_at`, `updated_at`, `location`, `title`, `description`, `lat`, `lang`) VALUES (3, NULL, '2011-03-24 13:30:20', '2011-03-24 13:30:20', NULL, 'nnnn', 'nnnn', NULL, NULL)
---
  def create
    @prayer = Prayer.new(params[:prayer])
      if params[:prayer][:title].blank? or params[:prayer][:description].blank?
          flash[:notice] = "Please Enter A Prayer All Fields"
          redirect_to :back
      else
        if params[:prayer][:title].length > 100 or params[:prayer][:description].length > 100
          flash[:notice] = "Your Prayer Title And Description Should Not Be Greater Than 100 Characters"
          redirect_to :back
         else
          respond_to do |format|
            if @prayer.save