app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def code_image
     @image_data = User.find(params[:id])

INSERT INTO `users` (`login`, `name`, `email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `remember_token_expires_at`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `reset_code`, `description`, `content_type`, `filename`, `binary_data`) VALUES ('kedar', '', 'kedar.pathak@pragtech.co.in', '498dc78d4f2e901e37fe9c81ec143aa7bb30d2ea', 'e61b53f42015943c5a5cbe68f154a32f7fc81350', '2011-04-27 12:23:55', '2011-04-27 12:23:55', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'accounting.png', NULL)
---
  def create
    logout_keeping_session!
    @user = User.new(params[:userr])
    @user.image_file(params[:userr][:image_file])
    success = @user && @user.save

SELECT `prayers`.* FROM `prayers` WHERE (user_id in (1,3)) ORDER BY id desc
SELECT `comments`.* FROM `comments` WHERE (`comments`.prayer_id = 9)
---
  def user_action
	    total_friend_user = current_user.friends
      total_friend_ids = []
      total_friend_user.each {|frid|  total_friend_ids << frid.id  }
      total_friend_ids << current_user.id
      @uprayer=[]
      @uprayer = Prayer.find(:all,:conditions=>"user_id in (#{total_friend_ids.join(',')})",:order =>"id desc")
      @usercomments = []
      @uprayer.each {|epry|  @usercomments << epry.comments }

SELECT `users`.* FROM `users` WHERE (`users`.`email` = 'kedar.pathak@pragtech.co.in') LIMIT 1
---
  def forgot
    if request.post?
      user = User.find_by_email(params[:user][:email])

SELECT `users`.* FROM `users` WHERE (`users`.`reset_code` = '184b2b99349515e28bd83fec2bd71dd71571b481') LIMIT 1
UPDATE `users` SET `crypted_password` = '73f91996ef35070ac37a5797f967fd973e8ef8bf', `updated_at` = '2011-04-26 10:09:06' WHERE (`users`.`id` = 2)
---
   def reset
    flash[:notice]=nil if flash[:notice]
    @user = User.find_by_reset_code(params[:reset_code]) unless params[:reset_code].nil?

    if @user.blank?
        flash[:notice] = "Your Reset Code Has Been Expire Please Send Request Again"
        redirect_to "/users/forgot"
    else

        if request.post?
          if params[:user][:password].blank? and params[:user][:password_confirmation].blank?
                  flash[:notice]="Please Enter Password"
                  render :action=>"reset"
          else
                if @user.update_attributes(:password => params[:user][:password], :password_confirmation => params[:user][:password_confirmation])